using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace BGU.DRPL.SignificantOwnership.Core.FXLicensing.Questionnares
{
    /// <summary>
    ///                                     Додаток 1                                       до Положення про порядок                                       видачі Національним банком                                       України індивідуальних                                       ліцензій на розміщення                                       резидентами (юридичними                                       та фізичними особами)                                       валютних цінностей на                                       рахунках за межами України  
    ///                                     __________________________                                              (Управління)  
    ///                              ПОВІДОМЛЕННЯ                   про відкриття рахунку за межами України 
    /// _________________________________________________________________           [повна назва або прізвище, ім'я, по батькові;
    /// _________________________________________________________________  ідентифікаційний код за ЄДРПОУ (ідентифікаційний номер за ДРФО);
    /// _________________________________________________________________               місцезнаходження або місце проживання] 
    /// повідомляє Національному банку України про відкриття ____________                                                      (тип рахунку)  рахунку N _______________ в _____________________________________            (номер рахунку)    (валютна цінність, у якій відкрито                                             рахунок)  за межами України в _____________________________________________                         (назва та місцезнаходження нерезидента,
    /// _________________________________________________________________                     у якого відкрито рахунок)
    ///    Рахунок відкритий _____ ________________ ______ року з метою:
    /// ________________________________________________________________.                      (мета відкриття рахунку) 
    /// ________________      ___________________________________________       (дата)            (підпис резидента або уповноваженої особи                             резидента, який відкрив рахунок) 
    ///                                      МП (якщо є) 
    /// В.о. директора Департаменту  валютного регулювання                               М.О.Мельничук 
    /// </summary>
    public class ForeignAccountOpenMsgAppx1
    {
    }
}
