using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace BGU.DRPL.SignificantOwnership.Core.FXLicensing.Questionnares
{
    /// <summary>
    ///                                      Додаток 10                                       до Положення про порядок                                       видачі Національним банком                                       України індивідуальних                                       ліцензій на розміщення                                       резидентами (юридичними                                       та фізичними особами)                                       валютних цінностей                                       на рахунках за межами                                       України
    ///                                      __________________________                                              (Управління)
    ///                                      __________________________                                          (податковий орган,                                        у якому власник ліцензії                                       зареєстрований як платник                                               податків)  
    ///                               ЗВІТ                   за ________________ 200__ року                     про рух валютних цінностей            за рахунком N _____________________________,                          (номер, тип, валютна цінність)       відкритим у _________________________________________ *                    (повна назва та країна місцезнаходження                                нерезидента)  
    /// -----------------------------------------------------------------------------------------------------------
    /// |  Дата     |Залишок|       Зараховано на рахунок         |             Використано з рахунку             |
    /// |           |на     |                                     |                                               |
    /// |           |початок|-------------------------------------+-----------------------------------------------|
    /// |           |дня    |усього|з рахунку|від      |з іншого  |інше|усього|на оплату|на рахунок|на інший |інше|
    /// |           |       |      |в уповно-|іноземних|рахунку,  |    |      |витрат за|в уповно- |рахунок, |    |
    /// |           |       |      |важеному |контра-  |відкритого|    |      |кордоном |важеному  |відкритий|    |
    /// |           |       |      |банку    |гентів   |за межами |    |      |         |банку     |за межами|    |
    /// |           |       |      |         |         |України   |    |      |         |          |України  |    |
    /// |-----------+-------+------+---------+---------+----------+----+------+---------+----------+---------+----|
    /// |    1      |   2   |   3  |    4    |    5    |     6    | 7  |  8   |    9    |    10    |    11   | 12 |
    /// |-----------+-------+------+---------+---------+----------+----+------+---------+----------+---------+----|
    /// |01.00.200_ |       |      |         |         |          |    |      |         |          |         |    |
    /// |           |       |      |         |         |          |    |      |         |          |         |    |
    /// |-----------+-------+------+---------+---------+----------+----+------+---------+----------+---------+----|
    /// |           |       |      |         |         |          |    |      |         |          |         |    |
    /// |           |       |      |         |         |          |    |      |         |          |         |    |
    /// |-----------+-------+------+---------+---------+----------+----+------+---------+----------+---------+----|
    /// |           |       |      |         |         |          |    |      |         |          |         |    |
    /// |-----------+-------+------+---------+---------+----------+----+------+---------+----------+---------+----|
    /// |31.00.200_ |       |      |         |         |          |    |      |         |          |         |    |
    /// |           |       |      |         |         |          |    |      |         |          |         |    |
    /// |-----------+-------+------+---------+---------+----------+----+------+---------+----------+---------+----|
    /// |Усього за  |       |      |         |         |          |    |      |         |          |         |    |
    /// |місяць     |       |      |         |         |          |    |      |         |          |         |    |
    /// ----------------------------------------------------------------------------------------------------------- 
    /// __________ ______________________________________________________    (дата)   (підпис власника ліцензії або уповноваженої ним особи) 
    ///                              МП (якщо є) 
    /// Виконавець ____________________             (прізвище, ініціали) 
    /// Номери контактних телефонів: _________________ 
    /// _______________      * фізична особа, яка не є підприємцем, заповнює рядки таблиці сумарно за календарними місяцями (тобто  таблиця,  заповнена  цією фізичною  особою,  міститиме  сім  рядків:  по  одному  на  кожний календарний місяць звітного періоду та всього за півроку). 
    /// В.о. директора Департаменту  валютного регулювання                               М.О.Мельничук 
    /// </summary>
    public class FXFundsMovesRptAppx10
    {
    }
}
