using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace BGU.DRPL.SignificantOwnership.Core.FXLicensing.Questionnares
{
    /// <summary>
    ///                                     Додаток 5                                       до Положення про порядок                                       видачі Національним банком                                       України індивідуальних                                       ліцензій на розміщення                                       резидентами (юридичними                                       та фізичними особами)                                       валютних цінностей                                       на рахунках за межами                                       України  
    ///                                     Національний банк України  
    ///                             ЗАЯВА          про видачу індивідуальної ліцензії на розміщення             резидентом валютних цінностей на рахунках                         за межами України  
    ///    На підставі  підпункту "д" пункту 4 статті 5 Декрету Кабінету  Міністрів України від 19.02.93 N  15-93  "Про  систему  валютного  регулювання і валютного контролю" _______________________________
    /// _________________________________________________________________           [повна назва або прізвище, ім'я, по батькові;  ідентифікаційний код за ЄДРПОУ (ідентифікаційний номер за ДРФО);          місцезнаходження або місце проживання заявника,                          поштовий індекс] 
    /// звертається до Національного банку України з проханням  дозволити  йому розмістити на рахунку/рахунках                     (зайве не писати)
    /// ________________________________________________________________,          (номери рахунків (за наявності), типи рахунків,                   валютні цінності на рахунках) 
    /// відкритому/відкритих/    що     відкриватиметься/відкриватимуться    (зайве не писати)  за межами України, в ____________________________________________                                (повна назва та країна
    /// ________________________________________________________________.    місцезнаходження нерезидента, у якого відкриваються рахунки) 
    ///    У попередньому періоді валютні  цінності  були  розміщені  на  рахунку/рахунках,   відкритому/відкритих   у  цього  нерезидента,               (зайве не писати)  відповідно до   індивідуальної   ліцензії   Національного   банку  України N _______________________________________________________  (вих. N _________________________________ від __.__.____).          (реєстраційний номер на номерному (дата надання ліцензії)           гербовому бланку Національного                   банку України) 
    ///              (ця інформація включається до заяви,                   якщо вищезазначене мало місце) 
    /// За цим рахунком/цими рахунками здійснюватимуться такі операції:           (зайве не писати)  на рахунки зараховуються _______________________________________;                               (перелік джерел і сум надходжень                                    валютних цінностей)  з рахунків списуються __________________________________________;                            (перелік цілей, на які дозволяється                                списувати валютні цінності,                                  із зазначенням обсягів) 
    /// залишки валютних   цінностей   на  рахунках  на  1  число  січня,  квітня,     липня,         жовтня       не       перевищуватимуть
    /// ________________________________________________________________.      (у разі подання кошторису, передбаченого абзацом сьомим
    ///    пункту 3.1 Положення, сума залишку не може перевищувати   суму списання за відповідний квартал згідно з цим кошторисом) 
    /// Потреба у  використанні  рахунку/рахунків   за   межами   України                           (зайве не писати)  викликана: _____________________________________________________.              (стисле обґрунтування потреби використання рахунків                 і проведення за ними кожного з видів операцій,                 економічної доцільності використання рахунків,               посилання на законодавчі підстави для використання                  рахунків, інформація про уповноважений банк,                 через який здійснюватимуться операції, тощо) 
    /// У статутному фонді заявника є/немає частки державного майна.                         (зайве не писати) 
    ///    З Положенням  про  порядок видачі Національним банком України  індивідуальних ліцензій на розміщення резидентами (юридичними  та  фізичними  особами)  валютних  цінностей  на  рахунках  за межами  України ознайомлений.  Зобов'язуюсь дотримуватися його  вимог  та  умов індивідуальної ліцензії. 
    /// До заяви додаються: _____________________________________________                                  (перелік документів,
    /// _________________________________________________________________                    кількість сторінок додатків) 
    /// _________________   _____________________________________________       (дата)         (підпис заявника або уповноваженої ним особи) 
    ///                                    МП (якщо є) 
    /// В.о. директора Департаменту  валютного регулювання                               М.О.Мельничук  
    /// </summary>
    public class IndividualFXLicenseApplAppx5
    {
    }
}
