using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace BGU.DRPL.SignificantOwnership.Core.FXLicensing.Questionnares
{
    /// <summary>
    ///                                     Додаток 6                                       до Положення про порядок                                       видачі Національним банком                                       України індивідуальних                                       ліцензій на розміщення                                       резидентами (юридичними                                       та фізичними особами)                                       валютних цінностей                                       на рахунках за межами                                       України  
    ///                                     Національний банк України  
    ///                             ЗАЯВА            про внесення змін до індивідуальної ліцензії       від __.__.____ N _____ на розміщення резидентом валютних              цінностей на рахунках за межами України  
    ///    На підставі підпункту "д" пункту 4 статті 5 Декрету  Кабінету  Міністрів  України  від  19.02.93  N 15-93 "Про систему валютного  регулювання і валютного контролю"
    /// _________________________________________________________________           [повна назва або прізвище, ім'я, по батькові;
    /// _________________________________________________________________  ідентифікаційний код за ЄДРПОУ (ідентифікаційний номер за ДРФО);          місцезнаходження або місце проживання заявника,                          поштовий індекс] 
    /// звертається до Національного банку України з проханням внести  до  індивідуальної  ліцензії  від  __.__.____  N  _____ на розміщення  валютних цінностей на рахунках за межами України такі зміни:
    /// _________________________________________________________________        (зміни, що потрібно внести, з обґрунтуванням потреби
    /// ________________________________________________________________.         їх унесення та посиланням на підтвердні документи) 
    ///    З Положенням про порядок видачі Національним  банком  України  індивідуальних  ліцензій на розміщення резидентами (юридичними та  фізичними особами)  валютних  цінностей  на  рахунках  за  межами  України  ознайомлений.  Зобов'язуюсь  дотримуватися його вимог та  умов індивідуальної ліцензії. 
    /// До заяви додаються: _____________________________________________                                  (перелік документів,
    /// _________________________________________________________________                    кількість сторінок додатків) 
    /// _________________   _____________________________________________       (дата)         (підпис заявника або уповноваженої ним особи) 
    ///                                    МП (якщо є) 
    /// В.о. директора Департаменту  валютного регулювання                               М.О.Мельничук  
    /// </summary>
    public class IndividualFXLisenceChangesApplAppx6
    {
    }
}
