using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using NUnit.Framework;
using BGU.DRPL.SignificantOwnership.Core.Spares.Dict;
using Newtonsoft.Json;

namespace BGU.DRPL.SignificantOwnership.Tests
{
    [TestFixture]
    public class LocationInfoTests
    {

        [Test]
        public void LocationInfoParser()
        {
            string addressesLnStr = @"61000,м.Харків, пр.Московський, буд.248, кв.31
61000,м.Харків,пр.Гагаріна,41а,кв.25
61166,м.Харків,вул.Леніна,5,кв.53
61000,м.Харків,вул.Артема,17,кв.3
62459,Харківська обл.,Харківський р-н.,пос.Високий,вул.Руднєва,34/2
61064,м.Харків,пров.Титаренківський, б.12, кв.40
61010,м.Харків,вул.Миргородська,буд.3
61000,м.Харків,вул.Танкопія,буд.11/3,кв.64
61010,м.Харків,вул.Миргородська,буд.3
61010,м.Харків,вул.Миргородська,буд.3,кв.1
61166,м.Харків,вул.Мінська,буд.109
61166,м.Харків,вул.Ромен Роллана,12
61058,м.Харків,вул.Ромен Роллана,12
61058,м.Харків,вул.Ромена Роллана,12
61000,м.Харків,вул. Танкопія, буд. 11/3, кв.64
61002,м.Харків,вул.Артема,46
61058,м.Харків,вул.Ромена Роллана,буд.12
61002,м.Харків, вул.Чубаря,1
62370,Харківська обл., Дергачівський р-н, смт.Солоницівка, вул. Пушкіна, буд.15/1
61022,м.Харків,вул.Сумська,буд.53,кв.4";

            string[] aAddrStrs = addressesLnStr.Split('\n');
            foreach (string addrStr in aAddrStrs)
                LocationInfoParserTestWorker(addrStr.Trim().Replace("\r", ""));
        }

        private void LocationInfoParserTestWorker(string src)
        {
            LocationInfo.ParseMatchInfo pmi;
            LocationInfo li = LocationInfo.Parse(src, out pmi);
            if (pmi.NonRecognizedParts.Count == 0)
                return;
            JsonSerializerSettings settings = new JsonSerializerSettings();
            settings.NullValueHandling = NullValueHandling.Ignore;
            string jsonStr = JsonConvert.SerializeObject(pmi, settings);
            string jsonStr1 = JsonConvert.SerializeObject(pmi.NonRecognizedParts, settings);
            Console.WriteLine("\"{0}\": nonrecognized - {1}, details: {2}", src, jsonStr1, jsonStr);
        }

        [Test]
        public void LocationInfoParser2()
        {
             LocationInfoParserTestWorker("61000,м.Харків,вул. Танкопія, буд. 11/3, кв.64");
        }

        [Test]
        public void LocationInfoParser3()
        {
            string addressesLnStr = @"01010,м.Києв, вул. Iвана Мазепи, 11-Б
01103,м.Києв, вул.Кiквiдзе,18-А
04128,м.Києв, вул. Ак. Туполґва, 17
01032,м.Києв, вул. Саксаганського,139
01001, м.Києв, вул.Б.Хмельницького, 6
01103, м.Києв, вул.Кiквiдзе, 11
01011 м. Києв, вул. Рибальська, буд.2
04209 м.Києв, вул. Героєв Днiпра,буд. 13, кв.50
08624 Києвська обл. смт.Калинiвка, вул. Шевченко-13
03110 м.Києв, вул.Семенiвська, буд.11, кв.12
02140 м.Києв, вул.Б.Гмирi,буд.3, кв.73
02140 м.Києв, вул.Б.Гмирi, буд.3, кв.120
02097 м.Києв, вул.Радунська, буд.10-а, кв. 86
04209 м.Києв, вул. Героєв Днiпра, буд.9, кв.15
04210 м.Києв, пр-т. Героєв Сталiнграда, буд.3, кв.8
02166 м.Києв, пр-т Лiсний, буд.3, кв.109
03170 м.Києв, вул. Зодчих, буд.60/1, кв.40
01004 м.Києв, вул.Пушкiнська, буд.21, кв. 26
Кiпр,Лiмассол,Арх.Макарiу III,140 Раптопулос Бiлдiнг,3-й поверх,офiс 301
49000,м.Днiпропетровськ, вул.Ленiна, буд.30
01021, м. Київ, провулок Виноградний, буд. 4, кв. 45
01033, м.Київ, вул. Жилянська, буд. 59, кв.1317
03115, м. Київ, просп. Перемоги, буд. 136, кв. 34
01133, м.Київ, вул. Щорса, 29
03115, м. Київ, просп.Перемоги, буд. 136, кв. 34
76000, м.Івано-Франківськ, вул.Галицька,114,кв.15
050051, м.Алмати, мікрорайон Самал-2, вул.Жолдасбекова,97
01034, м. Київ, вул. Ярославів вал, 13/2-Б
01133 м. Київ, вул. Щорса, буд. 29,
01025, м.Київ, вул. Володимрська, буд. 7, оф. 1
Україна,01030,місто Київ, вулиця Хмельницького Богдана,буд.72,кв.12
69084,м.Запоріжжя,вул.Димитрова,44
04070,м.Київ,Контрактова площа, 9
04070,м.Київ,Контрактова площа,9
04070,м.Київ, Контрактова площа,9
65058, м.Одеса, пр.Шевченка, 33, кв. 92
65039, м.Одеса, пр.Гагарiна, 12-А
65012, м. Одеса, вул. Пантелеймонiвська, 25
65012, м.Одеса, вул.Пантелеймонiвська, 25
65039, м.Одеса, пр.Гагарiна, 12 А
65007, м.Одеса, вул. Пантелеймонiвська, 25
65007, м.Одеса, вул.Новощепний ряд, 5
65039, м.Одеса, пр.Гагарiна, 12-А
65039, м.Одеса, пр.Гагарiна, 12-А
65039, м.Одеса, пр.Гагарiна,12-А
01015, м.Києв, вул.Лейпцизька, 16 (лiтера А)
65012, м.Одеса, вул.Рiшельґвська, 59
65058, м.Одеса, пр.Шевченка, 8-a
65039, м.Одеса, пр.Гагарiна, 12-А
65039, м.Одеса, пр. Гагарiна, 12-А
65039, м.Одеса, пр.Гагарiна, 12-А
65039, м.Одеса, пр.Гагарiна, 12 А
65012, м.Одеса, вул.Пантелеймонiвська, 25
65039, м.Одеса, пр.Гагарiна, 12-А
65039, м.Одеса, пр-т Гагарiна, 12-А
";

            string[] aAddrStrs = addressesLnStr.Split('\n');
            foreach (string addrStr in aAddrStrs)
                LocationInfoParserTestWorker(addrStr.Trim().Replace("\r", ""));
        }
    }
}
