using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using BGU.DRPL.SignificantOwnership.Core.Spares.Dict;
using System.ComponentModel;
using BGU.DRPL.SignificantOwnership.Core.Spares;
using BGU.DRPL.SignificantOwnership.Core.Spares.Data;
using Evolvex.Utility.Core.ComponentModelEx;

namespace BGU.DRPL.SignificantOwnership.Core.Questionnaires
{
    /// <summary>
    /// АНКЕТА кандидатів на посади голови правління і головного бухгалтера банку, заступників голови та членів правління, заступників головного бухгалтера, голови, його заступників та членів спостережної (наглядової) ради банку, представників юридичної особи - члена наглядової (спостережної) ради, керівника підрозділу внутрішнього аудиту
    /// Додаток 12 до Положення про порядок реєстрації та ліцензування банків, відкриття відокремлених підрозділів
    /// file                                  : f364524n1221.doc
    /// Рівень складності                     : 9
    /// (оціночний, шкала від 1 до 10)
    /// Пріоритетність                        : Hi  (Легенда: Hi - Висока, Lo - Низька, Mid - Середня, Hold - Поки що притримати)
    /// Подавач анкети                        : PP (Легенда: LP - юр.особа, PP - фіз.особа, BK - банк)
    /// Чи заповнюватиметься он-лайн          : Так
    /// Первинну розробку структури завершено : Ні
    /// Структуру фіналізовано                : Ні
    /// (=остаточно узгоджено 
    /// з бізнес-користувачами)
    /// </summary>
    public class RegLicAppx12HeadCandidateAppl : IQuestionnaire
    {
        #region cctor(s)
        public RegLicAppx12HeadCandidateAppl()
        {
            this.Education = new List<EducationRecordInfo>();
            this.MembershipIn3rdPartyBoards = new List<CouncilBodyInfo>();
            this.BankOwnership = new List<OwnershipStructure>();
            this.ThirdPartiesOwnership = new List<OwnershipStructure>();
            this.PartiesMgmtBodiesAttorneys = new List<CouncilBodyInfo>();
            this.ThirdPartiesBeingRepresented = new List<GenericPersonID>();
            this.OtherBanksSignificantOwnership = new List<OwnershipStructure>();
            this.OtherBanksWithSignificantOwnership = new List<BankInfo>();
            this.EmploymentGaps = new List<EmploymentRecordInfo>();
            this.LiquidatedOrInsolventManagements = new List<LiquidatedOrInsolventEntityMgmtRecordInfo>();
            this.PersonsLinks = new List<PersonsAssociation>();
            this.RelativesInBankBoards = new List<CouncilBodyInfo>();
            this.MiscNonRepaidDebts = new List<IndebtnessInfo>();
            this.BreachesOfLaw = new List<BreachOfLawRecordInfo>();
            this.MentionedIdentities = new List<GenericPersonInfo>();
        }
        #endregion


        #region Original fields
        /// <summary>
        /// у ___________________________________________________
        /// (повне офіційне найменування банку, 
        /// у який призначається/рекомендується керівник)
        /// </summary>
        [DisplayName("у банку")]
        [Description("(повне офіційне найменування банку, у який призначається/рекомендується керівник)")]
        [Required]
        public BankInfo BankRef { get; set; }

        /// <summary>
        /// 1. Посада, на яку призначається/рекомендується керівник, ____________________________.
        /// </summary>
        [DisplayName("Посада")]
        [Description("1. Посада, на яку призначається/рекомендується керівник")]
        [Required]
        public ManagementPosition PositionAppliedFor { get; set; }

        /// <summary>
        /// 2. Прізвище, ім'я та по батькові ___________________________________________________.
        /// 
        /// 3. Дата і місце народження _______________________________________________________
        ///                                (число, місяць, рік і місце народження
        /// ______________________________________________________________________________.
        ///                                із зазначенням країни та найменування населеного пункту)
        /// 
        /// 4. Громадянство ________________________________________________________________.
        /// 
        /// 5. Паспортні дані _______________________________________________________________.
        ///                                 (серія, номер, ким і коли виданий)
        /// 
        /// 6. Місце проживання ____________________________________________________________.
        /// 
        /// 7. Реєстраційний номер облікової картки платника податків ___________________________.
        /// </summary>
        [DisplayName("Кандидат")]
        [Description("Реквізити фізособи-кандидата на посаду...")]
        [Required]
        public GenericPersonID Candidate { get; set; }

        /// <summary>
        ///  8. Освіта і кваліфікація:
        ///  
        ///  № 
        ///  з/п	Найменування навчального закладу, у якому здобуто вищу освіту	Місцезнаходження навчального закладу	Період навчання	Здобуті спеціальність і кваліфікація
        /// </summary>
        [DisplayName("8. Освіта і кваліфікація")]
        [Description("8. Освіта і кваліфікація кандидата")]
        [Required]
        public List<EducationRecordInfo> Education { get; set; }

        [DisplayName("Чи має науковий ступінь, вчене звання?")]
        [Required]
        public bool HasScientificTitle { get; set; }
        /// <summary>
        /// Науковий ступінь, вчене звання (у разі наявності): ____________________________________.
        /// 
        /// Поле обов'язкове, якщо HasScientificTitle == true
        /// </summary>
        [DisplayName("Науковий ступінь, вчене звання")]
        public string ScientificTitle { get; set; }
     
        /// <summary>
        /// 9. Місце роботи і посада на дату заповнення анкети ___________________________________
        /// ________________________________________________________________________________
        /// (найменування юридичної  особи, її місцезнаходження, код за ЄДРПОУ, контактні телефони; посада,
        /// _______________________________________________________________________________.
        ///  час перебування на цій посаді, опис службових обов'язків за займаною посадою)
        /// 
        /// </summary>
        [DisplayName("Місце роботи")]
        [Description("9. Місце роботи і посада на дату заповнення анкети ")]
        [Required]
        public EmploymentRecordInfo LastEmploymentRecord { get; set; }
        
        /// <summary>
        /// 10. Чи  виконуєте Ви на цей час функції голови/члена наглядового, виконавчого чи контрольного органу в будь-якій юридичній особі? 
        /// </summary>
        [DisplayName("Чи є керівником/членом керівного органу?")]
        [Description("10. Чи  виконуєте Ви на цей час функції голови/члена наглядового, виконавчого чи контрольного органу в будь-якій юридичній особі? ?")]
        [Required]
        public bool IsCurrently3rdPartyBoardMember { get; set; }

        /// <summary>
        /// ________________________________________________________________________________
        /// 
        ///                                                              (найменування юридичної особи, її місцезнаходження, код за ЄДРПОУ,
        /// 
        /// _______________________________________________________________________________.
        /// 
        ///                                                           контактні телефони, вид діяльності юридичної особи, опис Ваших функцій)
        /// --------                                                          
        /// Поле заповнюється якщо IsCurrently3rdPartyBoardMember == true
        /// </summary>
        [DisplayName("Членство в керівних органах юр.осіб")]
        [Description("(найменування юридичної особи, її місцезнаходження, код за ЄДРПОУ, контактні телефони, вид діяльності юридичної особи, опис Ваших функцій)")]
        public List<CouncilBodyInfo> MembershipIn3rdPartyBoards { get; set; }

        /// <summary>
        /// 11. Чи маєте Ви участь у банку, у який призначаєтесь/рекомендуєтесь:
        /// </summary>
        public bool HasTheBankOwnership { get; set; }

        /// <summary>
        /// 11. Чи маєте Ви участь у банку, у який призначаєтесь/рекомендуєтесь:
        /// 
        /// а) пряме володіння - ____ відсотків у статутному капіталі банку в розмірі _______ гривень, що становить _________ акцій (паїв), загальною номінальною вартістю ________ гривень;
        /// 
        ///                                          (кількість)
        /// 
        /// б) опосередковане володіння - _____ відсотків через _____________ ________________________________________________________________________________
        /// 
        ///                                               (зазначаються найменування юридичної особи та/або прізвище, ім'я, по батькові
        /// 
        /// _______________________________________________________________________________.
        /// 
        ///                                                           фізичної особи - учасника банку та розмір її прямого володіння в банку)
        /// </summary>
        public List<OwnershipStructure> BankOwnership { get; set; }

        /// <summary>
        /// 12. Чи маєте Ви участь в інших  юридичних особах (прямо або опосередковано)? _______________________________________________________________________________.
        /// 
        /// Якщо відповідь позитивна, то зазначити:
        /// 
        /// найменування юридичної особи, код за ЄДРПОУ
        /// 
        /// _______________________________________________________________________________;
        /// 
        /// місцезнаходження _______________________________________________________________;
        /// 
        /// основний вид діяльності юридичної особи ___________________________________________;
        /// 
        /// відсоток власності в юридичній особі _______________________________________________.
        /// </summary>
        public bool Has3rdPartiesOwnership { get; set; }
        public List<OwnershipStructure> ThirdPartiesOwnership { get; set; }

        /// 
        /// Чи є Ваша довірена особа в наглядовому органі цієї юридичної особи? _______________________________________________________________________________.
        /// 
        /// 
        public bool Has3rdPartiesMgmtBodiesAttorneys { get; set; }
        public List<CouncilBodyInfo> PartiesMgmtBodiesAttorneys { get; set; }
        
        
        /// 13. Чи представляєте Ви інтереси іншої юридичної особи? __________
        /// _______________________________________________________________________________.
        /// (якщо так, то зазначити, якої саме юридичної особи, з яких питань)
        /// 
        public bool Is3rdPartiesRep { get; set; }
        /// <summary>
        /// 1. у цьому полі - лише перелік ID-шників осіб, що їх представляє кандидат
        /// 2. реквізити осіб - у MentionedEntities
        /// 3. Деталі представництва - у PersonLinks
        /// </summary>
        public List<GenericPersonID> ThirdPartiesBeingRepresented { get; set; }

        /// <summary>
        /// 14. Перелік банків, у яких Ви є власником істотної участі, ______
        /// _______________________________________________________________________________.
        ///      (зазначити конкретно: якою особою, у якому банку)
        /// </summary>
        public List<OwnershipStructure> OtherBanksSignificantOwnership { get; set; }
        /// <summary>
        /// не певен, чи нам потрібна додаткова явна ідентифікація цих банків як банків, 
        /// чи ж достатньо буде кодів ЄДРПОУ з OtherBanksSignificantOwnership
        /// </summary>
        public List<BankInfo> OtherBanksWithSignificantOwnership { get; set; }

      
        /// <summary>
        /// 15. Відомості  про  перерви в трудовій діяльності (із зазначенням 
        /// строку перерви та причини) _____________________________________.
        /// ----
        /// Заповнюємо наступні поля:
        /// State = Unemployed, DateStarted - дата початку періоду безробіття, DateQuit = дата закінчення безробіття, TerminationType - (також обов'язково) причина переходу в стан безробітний (зі списку), DismissalOrUnemployedReason - додаткові деталі щодо причини безробіття
        /// ----
        /// Маю підозру, що нам потрібно, насправді, повний перелік усіх записів у трудовій (та поза нею), а не лише розриви у труд.діяльності.
        /// </summary>
        public List<EmploymentRecordInfo> EmploymentGaps { get; set; }
        
        /// <summary>
        /// 16. Чи порушувалася справа про банкрутство, чи приймалося рішення про ліквідацію банку або іншої юридичної особи, де Ви раніше працювали керівником (на день прийняття таких рішень)? 
        /// </summary>
        public bool HasLiquidatedOrInsolventManagements { get; set; }

        /// <summary>
        /// ________________________________________________________________________
        /// (якщо так, то зазначити найменування юридичної особи, займану Вами в цій юридичний особі посаду,
        /// ________________________________________________________________________________
        /// період і причини порушення справи про банкрутство або прийняття
        /// _______________________________________________________________________________.
        /// рішення про ліквідацію)
        /// </summary>
        public List<LiquidatedOrInsolventEntityMgmtRecordInfo> LiquidatedOrInsolventManagements { get; set; }
        


        /// <summary>
        /// 17. Відомості про близьких родичів, чоловіка/дружину, дітей, батьків 
        /// ________________________________________________________________________________
        /// 
        /// ________________________________________________________________________________
        /// 
        /// ________________________________________________________________________________
        /// 
        /// ________________________________________________________________________________
        /// 
        /// _______________________________________________________________________________.
        /// (прізвища, імена, по батькові, дати і місця народження)
        /// ----
        /// У цьому полі - не лише відомості по п.17, а й решта зв'язків з особами-фігурантами анкети
        /// </summary>
        public List<PersonsAssociation> PersonsLinks { get; set; }

        /// <summary>
        /// 18. Чи  перебуваєте Ви в родинних зв'язках із членами ради та/або правління банку (батьки, діти, чоловік/дружина,  рідні брати та  сестри)? 
        /// </summary>
        public bool HasRelativesInBankBoards { get; set; }
        /// <summary>
        /// _______________________________________________________________________________.
        /// (якщо так, то зазначити посаду, прізвище, ім'я, по батькові особи та родинний зв'язок з нею)
        /// ----
        /// Поле заповнюється, якщо HasRelativesInBankBoards == true;
        /// доповнюється інформацією з полів MentionedEntities та PersonsLinks
        /// </summary>
        public List<CouncilBodyInfo> RelativesInBankBoards { get; set; }
        
        /// <summary>
        /// 19. Чи маєте Ви невиконані майнові (фінансові) зобов'язання перед іншими особами? 
        /// </summary>
        [Required]
        public bool HasMiscNonRepaidDebts { get; set; }

        /// <summary>
        /// ________________________________________________________________________________
        /// (якщо так, то зазначити, які саме зобов'язання, у якому розмірі, перед якою особою
        /// ________________________________________________________________________________
        /// та з яких причин не були виконані, а також подальші плани щодо виконання/невиконання цих зобов'язань)
        /// _______________________________________________________________________________.
        /// ----
        /// Обов'язкове, якщо HasMiscNonRepaidDebts == true
        /// </summary>
        [Required]
        public List<IndebtnessInfo> MiscNonRepaidDebts { get; set; }
        

        /// <summary>
        /// 20. Чи притягувалися Ви до кримінальної відповідальності? ____________________________
        /// </summary>
        [Required]
        public bool WasCriminallyProsecuted { get; set; }
        
        /// <summary>
        /// 21. Чи маєте Ви судимість непогашену,  не зняту  в  установленому законодавством порядку? 
        /// </summary>
        [Required]
        public bool HasOutstandingSentencesToServe { get; set; }

        /// <summary>
        /// п.20 :_______________________________________________________________________________.
        /// (якщо так, то зазначити, де і коли, за якою статтею/статтями Кримінального кодексу України)
        /// п.21: _______________________________________________________________________________.
        /// (якщо так, то зазначити детальну інформацію)
        /// ----
        /// Обов'язкове, якщо WasCriminallyProsecuted == true або HasOutstandingSentencesToServe == true
        /// </summary>
        public List<BreachOfLawRecordInfo> BreachesOfLaw { get; set; }
      
        /// <summary>
        /// 22. Ваше бачення діяльності банку і Вашої ролі в проведенні політики банку 
        /// ________________________________________________________________________________
        /// ________________________________________________________________________________
        /// _______________________________________________________________________________.
        /// </summary>
        [Required]
        public string BankPoliciesYourRoleVision { get; set; }

        /// <summary>
        /// Я, _____________________________________________________________________________,
        ///   (прізвище, ім'я, по батькові)
        /// 
        /// стверджую, що інформація, надана в анкеті, є правдивою і повною, та не заперечую проти 
        /// перевірки Національним банком України достовірності поданих документів і персональних 
        /// даних, що в них містяться.
        /// </summary>
        [DisplayName("Підтверджую правдивість інформації?")]
        [Description("Я, (прізвище, ім'я, по батькові) стверджую, що інформація,  надана в анкеті,\n є правдивою і повною, та не заперечую проти перевірки Національним банком України достовірності поданих документів і персональних даних, що в них містяться.\n")]
        [Editor(typeof(BGU.DRPL.SignificantOwnership.Core.TypeEditors.BooleanEditor), typeof(System.Drawing.Design.UITypeEditor))]
        [Required]
        public bool IsApplicationInfoAccurateAndTrue { get; set; }

        /// <summary>
        /// У разі будь-яких змін в інформації, що зазначена в цій анкеті, зобов'язуюся повідомити про них Національний банк України протягом 10 днів з дня їх виникнення.
        /// </summary>
        [DisplayName("Зобов'язуюсь повідомляти про зміни?")]
        [Description("У разі будь-яких змін в інформації, що зазначена в цій анкеті, зобов'язуюся повідомити про них Національний банк України протягом 10-ти днів з дня їх виникнення.")]
        [Editor(typeof(BGU.DRPL.SignificantOwnership.Core.TypeEditors.BooleanEditor), typeof(System.Drawing.Design.UITypeEditor))]
        [Required]
        public bool AmObligingToKeepUp2DateWithin10Days { get; set; }
        #endregion

        /// <summary>
        /// _____________________
        ///  (дата підписання анкети)
        /// _______________________
        ///  (підпис призначеного/
        /// Рекомендованого керівника)
	    /// _______________________
        ///  (ініціали, прізвище)
        /// </summary>
        [DisplayName("Підписант")]
        [Description("Відомості по особу, що підписала анкету")]
        [Required]
        public SignatoryInfo Signatory { get; set; }

        /// <summary>
        /// Усі реквізити усіх осіб-фігурантів
        /// </summary>
        public List<GenericPersonInfo> MentionedIdentities { get; set; }

        public string SuggestSaveAsFileName()
        {
            return "regLicDod12Kand";
        }
    }
}
