using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace BGU.DRPL.SignificantOwnership.Core.FXLicensing.Messages
{
    /// <summary>
    ///                                      Додаток 3                                       до Положення про порядок                                       видачі Національним банком                                       України індивідуальних                                       ліцензій на розміщення                                       резидентами (юридичними                                       та фізичними особами)                                       валютних цінностей                                       на рахунках за межами                                       України  
    ///                                      __________________________                                           (власник ліцензії) 
    ///                                      Копії: ___________________                                                 (Управління)
    ///                                      __________________________                                          (податковий орган,                                        у якому власник ліцензії                                       зареєстрований як платник                                               податків)  
    ///                  ІНДИВІДУАЛЬНА ЛІЦЕНЗІЯ N ____            на розміщення валютних цінностей на рахунках                         за межами України  
    ///     Національний банк   України   відповідно   до  підпункту  "д"  пункту 4 і пункту 6 статті 5 Декрету Кабінету  Міністрів  України  від 19.02.93   N  15-93  "Про  систему  валютного  регулювання  і  валютного  контролю"  дозволяє  розмістити  валютні  цінності  за  межами України:  власник ліцензії _______________________________________________,                              (прізвище, ім'я, по батькові)  ідентифікаційний номер _________________________________________,  місце проживання _______________________________________________. 
    /// Уповноважений банк _____________________________________________.                          (цей рядок уключається до ліцензії,                      якщо подається довідка уповноваженого банку,                             передбачена абзацом п'ятим                                пункту 3.1 Положення) 
    /// Нерезидент, у якого відкриті рахунки ___________________________.                                          (повна назва та країна                                            місцезнаходження) 
    /// Номери, типи рахунків, валютні цінності на рахунках
    /// ________________________________________________________________. 
    /// 1. Ліцензія надає її власнику право на проведення таких операцій: 
    ///     1.1. На рахунки зараховуються _______________________________                                       (перелік джерел надходжень
    ///    ______________________________________________________________           валютних цінностей і сум надходжень з рахунків
    ///    _____________________________________________________________;       в уповноваженому банку, який зазначений у ліцензії) 
    ///    1.2. З рахунків списуються __________________________________.                                         (перелік цілей,
    ///    ______________________________________________________________             на які дозволяється списувати валютні цінності,
    ///    ______________________________________________________________                      із зазначенням обсягів) 
    /// 2. Строк  дії  ліцензії:  з  __.__.____   до __.__.____ /з   дати                              (дд/мм/рррр)      (зайве не писати)   видачі ліцензії до __.__.____.                     (дд/мм/рррр) 
    /// 3. Власник ліцензії зобов'язаний:      подавати звітність  за операціями,  що проводяться відповідно  до цієї ліцензії,  у порядку,  установленому пунктом 6.3 глави  6  Положення   про   порядок   видачі  Національним  банком  України  індивідуальних ліцензій на розміщення резидентами (юридичними  та  фізичними  особами)  валютних  цінностей  на  рахунках  за межами  України;      після закінчення   строку   дії   ліцензії   виконати  вимоги  пункту 1.11 глави 1 Положення  про  порядок  видачі  Національним  банком  України індивідуальних ліцензій на розміщення резидентами  (юридичними та фізичними особами) валютних цінностей на  рахунках  за межами України;
    /// ________________________________________________________________.          (додаткові вимоги до власника ліцензії, якщо є) 
    /// Без права передавання третім особам. 
    /// Голова або уповноважена ним особа  (Начальник територіального  управління або уповноважена  ним особа)                           ____________________________                                       (підпис, ініціали, прізвище) 
    ///                                                   МП
    /// {  Додаток   3   із   змінами,   внесеними  згідно  з  Постановами Національного  банку  N  282  ( z0952-05 ) від 10.08.2005,  N  531 ( z0078-13 ) від 14.12.2012 } 
    /// В.о. директора Департаменту  валютного регулювання                               М.О.Мельничук
    /// </summary>
    public class IndividualFXLicenseAppx3
    {
    }
}
