using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace BGU.DRPL.SignificantOwnership.Core.FXLicensing.Messages
{
    /// <summary>
    ///                                     Додаток 9                                       до Положення про порядок                                       видачі Національним банком                                       України індивідуальних                                       ліцензій на розміщення                                       резидентами (юридичними                                       та фізичними особами)                                       валютних цінностей                                       на рахунках за межами                                       України
    ///                                     __________________________                                           (власник ліцензії) 
    ///                                     Копія: ___________________                                                 (Управління)
    ///                                     __________________________                                       (уповноважений банк, який                                       зазначений у ліцензії)
    ///                                     __________________________                                          (податковий орган,                                        у якому власник ліцензії                                       зареєстрований як платник                                               податків)  
    ///  Національний банк України повідомляє таке:    У зв'язку з ___________________________________________________                  (зазначаються підстави для анулювання ліцензії)  та на підставі __________________________________________________                      (посилання на абзаци пункту 4.4 Положення,                      у якому зазначені підстави для анулювання                                       ліцензії) 
    /// Положення про  порядок   видачі   Національним   банком   України  індивідуальних  ліцензій на розміщення резидентами (юридичними та  фізичними особами)  валютних  цінностей  на  рахунках  за  межами  України,  затвердженого  постановою Правління Національного банку  України від  __.__.____  N  ______,   згідно   з   розпорядженням  Національного банку    України   від   __.__.____   N   _________  індивідуальна ліцензія від __.__.____  N  _______  на  розміщення  валютних цінностей на рахунках за межами України анульована.  
    /// Голова  (уповноважена ним особа)            _____________________________                                       (підпис, ініціали, прізвище) 
    ///                                    МП 
    /// В.о. директора Департаменту  валютного регулювання                               М.О.Мельничук 
    /// </summary>
    public class IndividualFXLicenseAnnulMsgAppx9
    {
    }
}
