using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace BGU.DRPL.SignificantOwnership.Core.FXLicensing.Messages
{
    /// <summary>
    ///                                     Додаток 4
    ///                                     до Положення про порядок
    ///                                     видачі Національним банком
    ///                                     України індивідуальних
    ///                                     ліцензій на розміщення
    ///                                     резидентами (юридичними
    ///                                     та фізичними особами)
    ///                                     валютних цінностей
    ///                                     на рахунках за межами                                       України  
    ///                                     __________________________                                           (власник ліцензії) 
    ///                                     Копії: ___________________                                                 (Управління)
    ///                                     __________________________                                          (податковий орган,                                        у якому власник ліцензії                                       зареєстрований як платник                                               податків)  
    ///                             ЗМІНИ         до індивідуальної ліцензії від __.__.____ N ______            на розміщення валютних цінностей на рахунках                         за межами України  
    ///    Національний банк   України   відповідно   до  підпункту  "д"  пункту 4  і  пункту  6  статті  5  Декрету   Кабінету   Міністрів  України від  19.02.93  N 15-93 "Про систему валютного регулювання  і валютного  контролю"   вносить   до   індивідуальної   ліцензії  N __________ від __.__.____, виданої
    /// _________________________________________________________________           [повна назва або прізвище, ім'я, по батькові;
    /// _________________________________________________________________  ідентифікаційний код за ЄДРПОУ (ідентифікаційний номер за ДРФО);
    /// ________________________________________________________________,      місцезнаходження або місце проживання власника ліцензії]  такі зміни: ____________________________________________________.                           (зміни, що вносяться) 
    ///    Ці зміни,   починаючи  з  дати  їх  унесення,  є  невід'ємною  частиною   індивідуальної    ліцензії N _________________________  (вих. N _________________________________  від __.__.____).          (реєстраційний номер на номерному   (дата видачі           гербовому бланку Національного       ліцензії)                  банку України) 
    /// Без права передавання третім особам. 
    /// Голова або уповноважена ним особа  (Начальник територіального  управління або уповноважена  ним особа)                           ____________________________                                       (підпис, ініціали, прізвище) 
    ///                                                  МП 
    /// В.о. директора Департаменту  валютного регулювання                               М.О.Мельничук  
    /// </summary>
    public class IndividualFXLicenseChangesAppx4
    {
    }
}
